Repository: farmsmart/farmsmart-flutter
Catalog: assets/l10n/intl_*.arb
Languages: es, ja, sw

source: Farmsmart
ja: ファームスマート

source: Check out this article from the FarmSmart mobile app
es: Echa un vistazo a este artículo de la aplicación móvil FarmSmart
ja: FarmSmartモバイルアプリからこの記事をチェックしてください。
sw: Angalia makala hii kutoka kwenye programu ya simu ya FarmSmart

source: Error
ja: エラー
sw: Hitilafu

source: No Title
es: Sin título
ja: 無題
sw: Hakuna Title

source: Farmsmart Flutter App
es: Aplicación Farmsmart Flutter
ja: Farmsmart Flutterアプリ

source: Privacy Policies
es: Políticas de privacidad
ja: プライバシーポリシー
sw: Sera za Faragha

source: My Plot
es: Mi parcela
ja: 私のプロット
sw: Plot yangu

source: Profit/Loss
es: Pérdida de beneficios
ja: 利益損失
sw: Faida / Kupoteza

source: Discover
es: Descubrir
ja: 発見
sw: Kugundua

source: Community
es: Comunidad
ja: コミュニティ
sw: Jumuiya

source: CURRENT STAGE
es: ETAPA ACTUAL
ja: 現在のステージ
sw: HATUA YA KATIKA

source: DETAILS
es: DETALLES
ja: 詳細

source: My Crop
es: Mi cultivo
ja: 私の作物
sw: Mazao Yangu

source: Crop Details
es: Detalles de la cosecha
ja: 作物の詳細
sw: Maelezo ya Mazao

source: Complexity
es: Complejidad
ja: 複雑
sw: Ukamilifu

source: Best soil types
es: Mejores tipos de suelo
ja: 最高の土壌タイプ
sw: Aina za udongo bora

source: Time until maturity
es: Tiempo hasta la madurez.
ja: 成熟するまでの時間
sw: Muda mpaka ukomavu

source: Crops in rotation
es: Cultivos en rotación.
ja: 輪作
sw: Mazao katika mzunguko

source: Crop type
es: Tipo de cultivo
ja: 作物タイプ
sw: Aina ya mazao

source: Water requirement
es: Requerimiento de agua
ja: 水の必要量
sw: Mahitaji ya maji

source: Setup Cost
es: Coste de instalación
ja: セットアップ費用
sw: Gharama ya Kuweka

source: Profitability
es: Rentabilidad
ja: 収益性
sw: Faida

source: Companion Plants
es: Plantas Acompañantes
ja: コンパニオンプラント
sw: Mimea ya Companion

source: Non-Companion Plants
es: Plantas no complementarias
ja: 非コンパニオン植物
sw: Mipango isiyo ya Companion

source: Step-by-step guide
es: Guía paso por paso
ja: ステップバイステップガイド
sw: Mwongozo wa hatua kwa hatua
